Model: "3DCNN"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            [(None, 60, 40, 7, 1 0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 60, 40, 7, 1 0
__________________________________________________________________________________________________
input_3 (InputLayer)            [(None, 60, 40, 7, 1 0
__________________________________________________________________________________________________
input_4 (InputLayer)            [(None, 60, 40, 6, 1 0
__________________________________________________________________________________________________
input_5 (InputLayer)            [(None, 60, 40, 6, 1 0
__________________________________________________________________________________________________
conv3d (Conv3D)                 (None, 54, 34, 5, 1) 148         input_1[0][0]
__________________________________________________________________________________________________
conv3d_1 (Conv3D)               (None, 54, 34, 5, 1) 148         input_1[0][0]
__________________________________________________________________________________________________
conv3d_14 (Conv3D)              (None, 54, 34, 5, 1) 148         input_2[0][0]
__________________________________________________________________________________________________
conv3d_15 (Conv3D)              (None, 54, 34, 5, 1) 148         input_2[0][0]
__________________________________________________________________________________________________
conv3d_28 (Conv3D)              (None, 54, 34, 5, 1) 148         input_3[0][0]
__________________________________________________________________________________________________
conv3d_29 (Conv3D)              (None, 54, 34, 5, 1) 148         input_3[0][0]
__________________________________________________________________________________________________
conv3d_42 (Conv3D)              (None, 54, 34, 4, 1) 148         input_4[0][0]
__________________________________________________________________________________________________
conv3d_43 (Conv3D)              (None, 54, 34, 4, 1) 148         input_4[0][0]
__________________________________________________________________________________________________
conv3d_56 (Conv3D)              (None, 54, 34, 4, 1) 148         input_5[0][0]
__________________________________________________________________________________________________
conv3d_57 (Conv3D)              (None, 54, 34, 4, 1) 148         input_5[0][0]
__________________________________________________________________________________________________
average_pooling3d (AveragePooli (None, 27, 17, 5, 1) 0           conv3d[0][0]
__________________________________________________________________________________________________
average_pooling3d_1 (AveragePoo (None, 27, 17, 5, 1) 0           conv3d_1[0][0]
__________________________________________________________________________________________________
average_pooling3d_8 (AveragePoo (None, 27, 17, 5, 1) 0           conv3d_14[0][0]
__________________________________________________________________________________________________
average_pooling3d_9 (AveragePoo (None, 27, 17, 5, 1) 0           conv3d_15[0][0]
__________________________________________________________________________________________________
average_pooling3d_16 (AveragePo (None, 27, 17, 5, 1) 0           conv3d_28[0][0]
__________________________________________________________________________________________________
average_pooling3d_17 (AveragePo (None, 27, 17, 5, 1) 0           conv3d_29[0][0]
__________________________________________________________________________________________________
average_pooling3d_24 (AveragePo (None, 27, 17, 4, 1) 0           conv3d_42[0][0]
__________________________________________________________________________________________________
average_pooling3d_25 (AveragePo (None, 27, 17, 4, 1) 0           conv3d_43[0][0]
__________________________________________________________________________________________________
average_pooling3d_32 (AveragePo (None, 27, 17, 4, 1) 0           conv3d_56[0][0]
__________________________________________________________________________________________________
average_pooling3d_33 (AveragePo (None, 27, 17, 4, 1) 0           conv3d_57[0][0]
__________________________________________________________________________________________________
conv3d_2 (Conv3D)               (None, 21, 12, 3, 1) 127         average_pooling3d[0][0]
__________________________________________________________________________________________________
conv3d_3 (Conv3D)               (None, 21, 12, 3, 1) 127         average_pooling3d[0][0]
__________________________________________________________________________________________________
conv3d_4 (Conv3D)               (None, 21, 12, 3, 1) 127         average_pooling3d[0][0]
__________________________________________________________________________________________________
conv3d_8 (Conv3D)               (None, 21, 12, 3, 1) 127         average_pooling3d_1[0][0]
__________________________________________________________________________________________________
conv3d_9 (Conv3D)               (None, 21, 12, 3, 1) 127         average_pooling3d_1[0][0]
__________________________________________________________________________________________________
conv3d_10 (Conv3D)              (None, 21, 12, 3, 1) 127         average_pooling3d_1[0][0]
__________________________________________________________________________________________________
conv3d_16 (Conv3D)              (None, 21, 12, 3, 1) 127         average_pooling3d_8[0][0]
__________________________________________________________________________________________________
conv3d_17 (Conv3D)              (None, 21, 12, 3, 1) 127         average_pooling3d_8[0][0]
__________________________________________________________________________________________________
conv3d_18 (Conv3D)              (None, 21, 12, 3, 1) 127         average_pooling3d_8[0][0]
__________________________________________________________________________________________________
conv3d_22 (Conv3D)              (None, 21, 12, 3, 1) 127         average_pooling3d_9[0][0]
__________________________________________________________________________________________________
conv3d_23 (Conv3D)              (None, 21, 12, 3, 1) 127         average_pooling3d_9[0][0]
__________________________________________________________________________________________________
conv3d_24 (Conv3D)              (None, 21, 12, 3, 1) 127         average_pooling3d_9[0][0]
__________________________________________________________________________________________________
conv3d_30 (Conv3D)              (None, 21, 12, 3, 1) 127         average_pooling3d_16[0][0]
__________________________________________________________________________________________________
conv3d_31 (Conv3D)              (None, 21, 12, 3, 1) 127         average_pooling3d_16[0][0]
__________________________________________________________________________________________________
conv3d_32 (Conv3D)              (None, 21, 12, 3, 1) 127         average_pooling3d_16[0][0]
__________________________________________________________________________________________________
conv3d_36 (Conv3D)              (None, 21, 12, 3, 1) 127         average_pooling3d_17[0][0]
__________________________________________________________________________________________________
conv3d_37 (Conv3D)              (None, 21, 12, 3, 1) 127         average_pooling3d_17[0][0]
__________________________________________________________________________________________________
conv3d_38 (Conv3D)              (None, 21, 12, 3, 1) 127         average_pooling3d_17[0][0]
__________________________________________________________________________________________________
conv3d_44 (Conv3D)              (None, 21, 12, 2, 1) 127         average_pooling3d_24[0][0]
__________________________________________________________________________________________________
conv3d_45 (Conv3D)              (None, 21, 12, 2, 1) 127         average_pooling3d_24[0][0]
__________________________________________________________________________________________________
conv3d_46 (Conv3D)              (None, 21, 12, 2, 1) 127         average_pooling3d_24[0][0]
__________________________________________________________________________________________________
conv3d_50 (Conv3D)              (None, 21, 12, 2, 1) 127         average_pooling3d_25[0][0]
__________________________________________________________________________________________________
conv3d_51 (Conv3D)              (None, 21, 12, 2, 1) 127         average_pooling3d_25[0][0]
__________________________________________________________________________________________________
conv3d_52 (Conv3D)              (None, 21, 12, 2, 1) 127         average_pooling3d_25[0][0]
__________________________________________________________________________________________________
conv3d_58 (Conv3D)              (None, 21, 12, 2, 1) 127         average_pooling3d_32[0][0]
__________________________________________________________________________________________________
conv3d_59 (Conv3D)              (None, 21, 12, 2, 1) 127         average_pooling3d_32[0][0]
__________________________________________________________________________________________________
conv3d_60 (Conv3D)              (None, 21, 12, 2, 1) 127         average_pooling3d_32[0][0]
__________________________________________________________________________________________________
conv3d_64 (Conv3D)              (None, 21, 12, 2, 1) 127         average_pooling3d_33[0][0]
__________________________________________________________________________________________________
conv3d_65 (Conv3D)              (None, 21, 12, 2, 1) 127         average_pooling3d_33[0][0]
__________________________________________________________________________________________________
conv3d_66 (Conv3D)              (None, 21, 12, 2, 1) 127         average_pooling3d_33[0][0]
__________________________________________________________________________________________________
average_pooling3d_2 (AveragePoo (None, 7, 4, 3, 1)   0           conv3d_2[0][0]
__________________________________________________________________________________________________
average_pooling3d_3 (AveragePoo (None, 7, 4, 3, 1)   0           conv3d_3[0][0]
__________________________________________________________________________________________________
average_pooling3d_4 (AveragePoo (None, 7, 4, 3, 1)   0           conv3d_4[0][0]
__________________________________________________________________________________________________
average_pooling3d_5 (AveragePoo (None, 7, 4, 3, 1)   0           conv3d_8[0][0]
__________________________________________________________________________________________________
average_pooling3d_6 (AveragePoo (None, 7, 4, 3, 1)   0           conv3d_9[0][0]
__________________________________________________________________________________________________
average_pooling3d_7 (AveragePoo (None, 7, 4, 3, 1)   0           conv3d_10[0][0]
__________________________________________________________________________________________________
average_pooling3d_10 (AveragePo (None, 7, 4, 3, 1)   0           conv3d_16[0][0]
__________________________________________________________________________________________________
average_pooling3d_11 (AveragePo (None, 7, 4, 3, 1)   0           conv3d_17[0][0]
__________________________________________________________________________________________________
average_pooling3d_12 (AveragePo (None, 7, 4, 3, 1)   0           conv3d_18[0][0]
__________________________________________________________________________________________________
average_pooling3d_13 (AveragePo (None, 7, 4, 3, 1)   0           conv3d_22[0][0]
__________________________________________________________________________________________________
average_pooling3d_14 (AveragePo (None, 7, 4, 3, 1)   0           conv3d_23[0][0]
__________________________________________________________________________________________________
average_pooling3d_15 (AveragePo (None, 7, 4, 3, 1)   0           conv3d_24[0][0]
__________________________________________________________________________________________________
average_pooling3d_18 (AveragePo (None, 7, 4, 3, 1)   0           conv3d_30[0][0]
__________________________________________________________________________________________________
average_pooling3d_19 (AveragePo (None, 7, 4, 3, 1)   0           conv3d_31[0][0]
__________________________________________________________________________________________________
average_pooling3d_20 (AveragePo (None, 7, 4, 3, 1)   0           conv3d_32[0][0]
__________________________________________________________________________________________________
average_pooling3d_21 (AveragePo (None, 7, 4, 3, 1)   0           conv3d_36[0][0]
__________________________________________________________________________________________________
average_pooling3d_22 (AveragePo (None, 7, 4, 3, 1)   0           conv3d_37[0][0]
__________________________________________________________________________________________________
average_pooling3d_23 (AveragePo (None, 7, 4, 3, 1)   0           conv3d_38[0][0]
__________________________________________________________________________________________________
average_pooling3d_26 (AveragePo (None, 7, 4, 2, 1)   0           conv3d_44[0][0]
__________________________________________________________________________________________________
average_pooling3d_27 (AveragePo (None, 7, 4, 2, 1)   0           conv3d_45[0][0]
__________________________________________________________________________________________________
average_pooling3d_28 (AveragePo (None, 7, 4, 2, 1)   0           conv3d_46[0][0]
__________________________________________________________________________________________________
average_pooling3d_29 (AveragePo (None, 7, 4, 2, 1)   0           conv3d_50[0][0]
__________________________________________________________________________________________________
average_pooling3d_30 (AveragePo (None, 7, 4, 2, 1)   0           conv3d_51[0][0]
__________________________________________________________________________________________________
average_pooling3d_31 (AveragePo (None, 7, 4, 2, 1)   0           conv3d_52[0][0]
__________________________________________________________________________________________________
average_pooling3d_34 (AveragePo (None, 7, 4, 2, 1)   0           conv3d_58[0][0]
__________________________________________________________________________________________________
average_pooling3d_35 (AveragePo (None, 7, 4, 2, 1)   0           conv3d_59[0][0]
__________________________________________________________________________________________________
average_pooling3d_36 (AveragePo (None, 7, 4, 2, 1)   0           conv3d_60[0][0]
__________________________________________________________________________________________________
average_pooling3d_37 (AveragePo (None, 7, 4, 2, 1)   0           conv3d_64[0][0]
__________________________________________________________________________________________________
average_pooling3d_38 (AveragePo (None, 7, 4, 2, 1)   0           conv3d_65[0][0]
__________________________________________________________________________________________________
average_pooling3d_39 (AveragePo (None, 7, 4, 2, 1)   0           conv3d_66[0][0]
__________________________________________________________________________________________________
conv3d_5 (Conv3D)               (None, 1, 1, 3, 1)   29          average_pooling3d_2[0][0]
__________________________________________________________________________________________________
conv3d_6 (Conv3D)               (None, 1, 1, 3, 1)   29          average_pooling3d_3[0][0]
__________________________________________________________________________________________________
conv3d_7 (Conv3D)               (None, 1, 1, 3, 1)   29          average_pooling3d_4[0][0]
__________________________________________________________________________________________________
conv3d_11 (Conv3D)              (None, 1, 1, 3, 1)   29          average_pooling3d_5[0][0]
__________________________________________________________________________________________________
conv3d_12 (Conv3D)              (None, 1, 1, 3, 1)   29          average_pooling3d_6[0][0]
__________________________________________________________________________________________________
conv3d_13 (Conv3D)              (None, 1, 1, 3, 1)   29          average_pooling3d_7[0][0]
__________________________________________________________________________________________________
conv3d_19 (Conv3D)              (None, 1, 1, 3, 1)   29          average_pooling3d_10[0][0]
__________________________________________________________________________________________________
conv3d_20 (Conv3D)              (None, 1, 1, 3, 1)   29          average_pooling3d_11[0][0]
__________________________________________________________________________________________________
conv3d_21 (Conv3D)              (None, 1, 1, 3, 1)   29          average_pooling3d_12[0][0]
__________________________________________________________________________________________________
conv3d_25 (Conv3D)              (None, 1, 1, 3, 1)   29          average_pooling3d_13[0][0]
__________________________________________________________________________________________________
conv3d_26 (Conv3D)              (None, 1, 1, 3, 1)   29          average_pooling3d_14[0][0]
__________________________________________________________________________________________________
conv3d_27 (Conv3D)              (None, 1, 1, 3, 1)   29          average_pooling3d_15[0][0]
__________________________________________________________________________________________________
conv3d_33 (Conv3D)              (None, 1, 1, 3, 1)   29          average_pooling3d_18[0][0]
__________________________________________________________________________________________________
conv3d_34 (Conv3D)              (None, 1, 1, 3, 1)   29          average_pooling3d_19[0][0]
__________________________________________________________________________________________________
conv3d_35 (Conv3D)              (None, 1, 1, 3, 1)   29          average_pooling3d_20[0][0]
__________________________________________________________________________________________________
conv3d_39 (Conv3D)              (None, 1, 1, 3, 1)   29          average_pooling3d_21[0][0]
__________________________________________________________________________________________________
conv3d_40 (Conv3D)              (None, 1, 1, 3, 1)   29          average_pooling3d_22[0][0]
__________________________________________________________________________________________________
conv3d_41 (Conv3D)              (None, 1, 1, 3, 1)   29          average_pooling3d_23[0][0]
__________________________________________________________________________________________________
conv3d_47 (Conv3D)              (None, 1, 1, 2, 1)   29          average_pooling3d_26[0][0]
__________________________________________________________________________________________________
conv3d_48 (Conv3D)              (None, 1, 1, 2, 1)   29          average_pooling3d_27[0][0]
__________________________________________________________________________________________________
conv3d_49 (Conv3D)              (None, 1, 1, 2, 1)   29          average_pooling3d_28[0][0]
__________________________________________________________________________________________________
conv3d_53 (Conv3D)              (None, 1, 1, 2, 1)   29          average_pooling3d_29[0][0]
__________________________________________________________________________________________________
conv3d_54 (Conv3D)              (None, 1, 1, 2, 1)   29          average_pooling3d_30[0][0]
__________________________________________________________________________________________________
conv3d_55 (Conv3D)              (None, 1, 1, 2, 1)   29          average_pooling3d_31[0][0]
__________________________________________________________________________________________________
conv3d_61 (Conv3D)              (None, 1, 1, 2, 1)   29          average_pooling3d_34[0][0]
__________________________________________________________________________________________________
conv3d_62 (Conv3D)              (None, 1, 1, 2, 1)   29          average_pooling3d_35[0][0]
__________________________________________________________________________________________________
conv3d_63 (Conv3D)              (None, 1, 1, 2, 1)   29          average_pooling3d_36[0][0]
__________________________________________________________________________________________________
conv3d_67 (Conv3D)              (None, 1, 1, 2, 1)   29          average_pooling3d_37[0][0]
__________________________________________________________________________________________________
conv3d_68 (Conv3D)              (None, 1, 1, 2, 1)   29          average_pooling3d_38[0][0]
__________________________________________________________________________________________________
conv3d_69 (Conv3D)              (None, 1, 1, 2, 1)   29          average_pooling3d_39[0][0]
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 1, 1, 3, 6)   0           conv3d_5[0][0]
                                                                 conv3d_6[0][0]
                                                                 conv3d_7[0][0]
                                                                 conv3d_11[0][0]
                                                                 conv3d_12[0][0]
                                                                 conv3d_13[0][0]
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 1, 1, 3, 6)   0           conv3d_19[0][0]
                                                                 conv3d_20[0][0]
                                                                 conv3d_21[0][0]
                                                                 conv3d_25[0][0]
                                                                 conv3d_26[0][0]
                                                                 conv3d_27[0][0]
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 1, 1, 3, 6)   0           conv3d_33[0][0]
                                                                 conv3d_34[0][0]
                                                                 conv3d_35[0][0]
                                                                 conv3d_39[0][0]
                                                                 conv3d_40[0][0]
                                                                 conv3d_41[0][0]
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 1, 1, 2, 6)   0           conv3d_47[0][0]
                                                                 conv3d_48[0][0]
                                                                 conv3d_49[0][0]
                                                                 conv3d_53[0][0]
                                                                 conv3d_54[0][0]
                                                                 conv3d_55[0][0]
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 1, 1, 2, 6)   0           conv3d_61[0][0]
                                                                 conv3d_62[0][0]
                                                                 conv3d_63[0][0]
                                                                 conv3d_67[0][0]
                                                                 conv3d_68[0][0]
                                                                 conv3d_69[0][0]
__________________________________________________________________________________________________
flatten (Flatten)               (None, 18)           0           concatenate[0][0]
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 18)           0           concatenate_1[0][0]
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 18)           0           concatenate_2[0][0]
__________________________________________________________________________________________________
flatten_3 (Flatten)             (None, 12)           0           concatenate_3[0][0]
__________________________________________________________________________________________________
flatten_4 (Flatten)             (None, 12)           0           concatenate_4[0][0]
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 78)           0           flatten[0][0]
                                                                 flatten_1[0][0]
                                                                 flatten_2[0][0]
                                                                 flatten_3[0][0]
                                                                 flatten_4[0][0]
__________________________________________________________________________________________________
dense (Dense)                   (None, 128)          10112       concatenate_5[0][0]
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1)            129         dense[0][0]
==================================================================================================
Total params: 16,401
Trainable params: 16,401
Non-trainable params: 0
__________________________________________________________________________________________________
